* Generate a new mini.iso with autoinstallation capabilities

** References
I used the following links to get the required information:
 - http://overtag.dk/wordpress/2013/08/ubuntu-kickstart-preseeding-and-wireless-wlan/
 - http://www.thegeekstuff.com/2009/07/how-to-view-modify-and-recreate-initrd-img/

** Download 14.04.2 mini.iso

Download a trusty mini.iso and check if the download went well
#+BEGIN_SRC sh
wget --quiet 'http://archive.ubuntu.com/ubuntu/dists/trusty/main/installer-amd64/current/images/netboot/mini.iso'
wget --quiet -O - 'http://archive.ubuntu.com/ubuntu/dists/trusty/main/installer-amd64/current/images/MD5SUMS' | grep "netboot/mini.iso" | sed 's/netboot\///g' > MD5SUMS
md5sum -c MD5SUMS
#+END_SRC

#+results:
: ./mini.iso: OK

** Mount the CD image and copy the content
#+BEGIN_SRC sh
mkdir iso
#+END_SRC

#+results:

#+BEGIN_SRC sh :dir /sudo::
sudo mount -o loop -t iso9660 mini.iso iso
#+END_SRC

#+BEGIN_SRC sh
cp -R iso custom
chmod -R +Xrw custom
#+END_SRC

#+results:

** Uncompress the initrd.gz
#+BEGIN_SRC sh :dir ./custom/
mkdir initrd
cd initrd
zcat ../initrd.gz | cpio -id
#+END_SRC

#+results:

** Adding a kickstart file to the initrd folder
#+BEGIN_SRC sh :dir ./custom/initrd/
mkdir -p var/ks-install/
#+END_SRC

#+results:

The password which is used for user creation can be generated using the following code snipped:
#+BEGIN_SRC sh
sudo apt-get install whois # package contains the command mkpasswd
mkpasswd -m sha-512        # generate a sha512 hashed password
#+END_SRC

#+BEGIN_EXAMPLE

#+END_EXAMPLE

#+BEGIN_SRC sh :tangle ./custom/initrd/var/ks-install/ks.cfg
#Generated by Kickstart Configurator
#platform=AMD64 or Intel EM64T

#System language
lang en_GB
#Language modules to install
langsupport en_GB de_DE --default=en_GB
#System keyboard
keyboard de
#System mouse
mouse
#System timezone
timezone Europe/Berlin
#Root password
rootpw --disabled
#Initial user
user genomics --fullname "Genomics administrator" --iscrypted --password $6$rXZRlzL24D$UeXGSOwb6KATwUqfxyCIBs4A1mzSp.tTu/z9WGY9mGC6GVKXNuQNylmLbVTQdk2j5/UsN.nDXCr/wfvxd24qa1
#Reboot after installation
reboot
#Use text mode install
text
#Install OS instead of upgrade
install
#Use CDROM installation media
url --url ftp://ftp.halifax.rwth-aachen.de/ubuntu/
#System bootloader configuration
bootloader --location=mbr
#Clear the Master Boot Record
zerombr yes
#Partition clearing information
clearpart --all --initlabel
#Disk partitioning information
part swap --size 12000 --asprimary
part / --fstype ext4 --size 1 --grow --asprimary
#System authorization infomation
auth  --useshadow  --enablemd5 --enablenis --nisdomain bioinformatik --nisserver 132.187.22.129
# Network
network --bootproto=dhcp --device=eth0
#Firewall configuration
firewall --enabled --ssh
#Do not configure the X Window System
skipx
#Package install information
%packages
openssh-server
openssh-client
autofs
nfs-common
git

%post
# move genomics home directory to a separate folder
mkdir -p /home2
sudo usermod  -d /home2  -m  genomics

date +"# [%Y-%m-%d %H:%M:%S] Added by the kickstart script to add automount capabilities
automount: nis files" >> /etc/nsswitch.conf

## Update packages and keys list
apt-key update
apt-get update

apt-get dist-upgrade --assume-yes
#+END_SRC

** Repacking of the initrd.gz
#+BEGIN_SRC sh :dir ./custom/
rm ./initrd.gz
cd initrd
find . | cpio --create --format='newc' | gzip > ../initrd.gz
cd ..
rm -rf initrd
#+END_SRC

#+results:

** Changing the txt.cfg file to add kickstart file
#+BEGIN_SRC sh :dir ./custom/
sed -i '/append/s+--+ks=file:/var/ks-install/ks.cfg preseed/file=/cdrom/ks.preseed --+g' txt.cfg
#+END_SRC

#+results:

** Recreate the ISO file
#+BEGIN_SRC sh
  mkisofs \
      -r \
      -V "Custom Ubuntu Netboot image" \
      -cache-inodes \
      -J \
      -l \
      -b isolinux.bin \
      -c boot.cat \
      -no-emul-boot \
      -boot-load-size 4 \
      -boot-info-table \
      -o custom.iso \
      custom
#+END_SRC
